import requests
from bs4 import BeautifulSoup


def get_road() -> list:
    """
    get street list from web

    :return:
    """
    result = requests.get("https://jiaowei.ncpb.gov.tw/sc11/incase3.aspx")
    soup = BeautifulSoup(result.text, 'html.parser')
    soup_list = soup.find("span", {"class": "style24"}).find_all("option")

    for road in soup_list:
        street_list.append(road.text)

    return street_list


street_list = ['八卦路', '八德路', '力行一街', '力行二街', '力行三街', '力行五街', '力行街', '三和一路', '三和二路', '三和二路一街', '三和二路二街', '三和三路', '下庄巷',
               '千和路', '千秋路', '大同南街', '大同街', '大庄路', '大埤街', '工業北一路', '工業北二路', '工業北三路', '工業北五路', '工業北六路', '工業北路', '工業東路',
               '工業南一路', '工業南七路', '工業南九路', '工業南二路', '工業南三路', '工業南五路', '工業南六路', '工業路', '中山一街', '中山南街', '中山街', '中華路',
               '中學西路', '中學街', '中興一路', '中興路', '中興路一街', '中興路二街', '仁心街', '仁和路', '仁政街', '仁智街', '仁愛路', '仁義南路', '仁義路', '仁德路',
               '內興路', '公所街', '公園南街', '公園街', '文化南路', '文化路', '文昌街', '文林路', '文獻路', '王井街', '平山一路', '平山一路一街', '平山一路二街',
               '平山一路三街', '平山一路四街', '平山二路', '平和街', '民生街', '民族路', '民權街', '永鳴路', '永興路', '永興路一街', '玉井街', '光明一路', '光明二路',
               '光明三路', '光明五路', '光明四路', '光明南路', '光明路', '光興街', '吉利路', '同源路', '同源路一街', '同源路七街', '同源路九街', '同源路二街', '同源路八街',
               '同源路十街', '同源路三街', '同源路五街', '同源路六街', '同源路四街', '向上一路', '向上二路', '向上三路', '向上五路', '向上六路', '向上路', '向陽路',
               '成功一路', '成功二路', '成功二路一街', '成功三路', '成功三路二街', '成功三路三街', '成功三路五街', '成功三路四街', '成功東路', '成功街', '竹林路', '竹林路一街',
               '竹林路二街', '竹林路三街', '自立一路', '自立二路', '自立三路', '自強一街', '自強一路', '自強二街', '自強二路', '自強三路', '自強路', '自強路三街', '育樂一街',
               '育樂路', '府南一路', '府南二路', '府南路一街', '府南路二街', '忠孝一街', '忠孝七街', '忠孝二街', '忠孝八街', '忠孝三街', '忠孝五街', '忠孝六街', '忠孝四街',
               '忠孝路', '明新路', '東山路', '東山路一街', '東閔路', '芳美路', '虎山路', '信義街', '南崗一路', '南崗二路', '南崗三路', '南鄉路', '南陽路', '南新路',
               '南營路', '建國路', '祖祠東路', '祖祠路', '軍功路', '振興巷', '菓稟路', '復與路', '復興路', '復興路一街', '猴探井街', '琯溪街', '華陽路', '集賢路',
               '順溪北路', '順溪南路', '新市路', '新光路', '新興路', '福崗路', '嘉和一路', '嘉和二路', '嘉和北路', '彰南路', '鳳山路', '鳳鳴路', '樂利一路', '樂利二街',
               '樂利二路', '樂利三街', '樂利三路', '樂利五街', '樂利六街', '樂利路', '學府一街', '學府七街', '學府九街', '學府二街', '學府八街', '學府三街', '學府五街',
               '學藝一路', '學藝二路', '學藝三路', '學藝路', '興和巷', '龍井街', '嶺興路', '營中路', '營北路', '營盤路', '藍田街']
